gsocco/LPC845_CO2/LPC845_CO2/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO1_0_MODE_INACTIVE 0x00u
/*!
 * @brief
 * Selects function mode (on-chip pull-up/pull-down resistor control).
 * : Inactive.
 * Inactive (no pull-down/pull-up resistor enabled).
 */
#define PIO1_1_MODE_INACTIVE 0x00u

/*! @name PIO1_0 (number 15), LED_VERDE
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_VERDE_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_VERDE_GPIO_PIN_MASK (1U << 0U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LED_VERDE_PORT 1U                  /*!<@brief PORT device index: 1 */
#define BOARD_INITPINS_LED_VERDE_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED_VERDE_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PIO1_1 (number 18), LED_ROJO
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_ROJO_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_ROJO_GPIO_PIN_MASK (1U << 1U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LED_ROJO_PORT 1U                  /*!<@brief PORT device index: 1 */
#define BOARD_INITPINS_LED_ROJO_PIN 1U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED_ROJO_PIN_MASK (1U << 1U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*! @name PIO1_10 (number 64), LCD_D4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LCD_D4_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LCD_D4_GPIO_PIN_MASK (1U << 10U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LCD_D4_PORT 1U                   /*!<@brief PORT device index: 1 */
#define BOARD_INITPINS_LCD_D4_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_D4_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO1_11 (number 62), LCD_D5
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LCD_D5_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LCD_D5_GPIO_PIN_MASK (1U << 11U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LCD_D5_PORT 1U                   /*!<@brief PORT device index: 1 */
#define BOARD_INITPINS_LCD_D5_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_D5_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO1_21 (number 59), LCD_D6
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LCD_D6_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LCD_D6_GPIO_PIN_MASK (1U << 21U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LCD_D6_PORT 1U                   /*!<@brief PORT device index: 1 */
#define BOARD_INITPINS_LCD_D6_PIN 21U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_D6_PIN_MASK (1U << 21U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO1_20 (number 56), LCD_D7
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LCD_D7_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LCD_D7_GPIO_PIN_MASK (1U << 20U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LCD_D7_PORT 1U                   /*!<@brief PORT device index: 1 */
#define BOARD_INITPINS_LCD_D7_PIN 20U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_D7_PIN_MASK (1U << 20U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO0_12 (number 4), LCD_E
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LCD_E_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LCD_E_GPIO_PIN_MASK (1U << 12U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LCD_E_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITPINS_LCD_E_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_E_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO0_13 (number 2), LCD_RS
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LCD_RS_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LCD_RS_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LCD_RS_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITPINS_LCD_RS_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LCD_RS_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PIO0_0 (number 48), MH_RX
  @{ */
#define BOARD_INITPINS_MH_RX_PORT 0U                  /*!<@brief PORT device index: 0 */
#define BOARD_INITPINS_MH_RX_PIN 0U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_MH_RX_PIN_MASK (1U << 0U)      /*!<@brief PORT pin mask */
                                                      /* @} */

/*! @name PIO0_14 (number 49), MH_TX
  @{ */
#define BOARD_INITPINS_MH_TX_PORT 0U                   /*!<@brief PORT device index: 0 */
#define BOARD_INITPINS_MH_TX_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_MH_TX_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*! @name PIO1_2 (number 20), BUZZER
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_BUZZER_GPIO GPIO                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_BUZZER_GPIO_PIN_MASK (1U << 2U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_BUZZER_PORT 1U                  /*!<@brief PORT device index: 1 */
#define BOARD_INITPINS_BUZZER_PIN 2U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_BUZZER_PIN_MASK (1U << 2U)      /*!<@brief PORT pin mask */
                                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M0P */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
